Revit 2022 API
AnalyticalSupportChecking Class
 Utilities that allow for detection of incorrect or incomplete analytical supports.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public static class AnalyticalSupportChecking
Visual Basic
Public NotInheritable Class AnalyticalSupportChecking
Visual C++
public ref class AnalyticalSupportChecking abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.AnalyticalSupportChecking
See Also
AnalyticalSupportChecking Members
Autodesk.Revit.DB.Structure Namespace